Tekla Open API Reference for Tekla Structures 2025
DistanceList.Insert Method
 Inserts an item at the specified position.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Insert(
	int index,
	Distance item
)
Public Sub Insert (
	index As Integer,
	item As Distance
)
Parameters
index
Type: System.Int32
The index of the insertion point.
item
Type: Tekla.Structures.Datatype.Distance
The item to be inserted.
Implements
IList<T>.Insert(Int32, T)
Examples
 This example shows how to insert a new Distance instance at the beginning of the DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance[] distances = { new Distance(30.2), new Distance(2.3) };
           DistanceList distanceList = new DistanceList(distances);
           distanceList.Insert(0, new Distance(2));
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace